src/AccumulationRegisters/СерииНоменклатурыКРасходу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>СерииНоменклатурыКРасходу</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/СерииНоменклатурыКРасходу/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью набора записей.
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Установка исключительной блокировки текущего набора записей регистратора.
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СерииНоменклатурыКРасходу.НаборЗаписей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Регистратор", Отбор.Регистратор.Значение);
	Блокировка.Заблокировать();
	
	Если НЕ СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыКРасходуИзменение")
			ИЛИ СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыКРасходуИзменение")
			И НЕ СтруктураВременныеТаблицы.ДвиженияСерииНоменклатурыКРасходуИзменение Тогда

		// Если временная таблица "ДвиженияСерииНоменклатурыКРасходуИзменение" не существует или не содержит записей
		// об изменении набора, значит набор записывается первый раз или для набора был выполнен контроль остатков.
		// Текущее состояние набора помещается во временную таблицу "ДвиженияСерииНоменклатурыКРасходуПередЗаписью",
		// чтобы при записи получить изменение нового набора относительно текущего.
		Запрос = Новый Запрос("ВЫБРАТЬ
			|	СерииНоменклатурыКРасходу.НомерСтроки КАК НомерСтроки,
			|	СерииНоменклатурыКРасходу.Номенклатура КАК Номенклатура,
			|	СерииНоменклатурыКРасходу.Характеристика КАК Характеристика,
			|	СерииНоменклатурыКРасходу.Партия КАК Партия,
			|	СерииНоменклатурыКРасходу.Серия КАК Серия,
			|	СерииНоменклатурыКРасходу.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	ВЫБОР
			|		КОГДА СерииНоменклатурыКРасходу.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ТОГДА СерииНоменклатурыКРасходу.Количество
			|		ИНАЧЕ -СерииНоменклатурыКРасходу.Количество
			|	КОНЕЦ КАК КоличествоПередЗаписью
			|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыКРасходуПередЗаписью
			|ИЗ
			|	РегистрНакопления.СерииНоменклатурыКРасходу КАК СерииНоменклатурыКРасходу
			|ГДЕ
			|	СерииНоменклатурыКРасходу.Регистратор = &Регистратор
			|	И &Замещение");

		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);

		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();

	Иначе

	// Если временная таблица "ДвиженияСерииНоменклатурыКРасходуИзменение" существует и содержит записи
	// об изменении набора, значит набор записывается не первый раз и для набора не был выполнен контроль остатков.
	// Текущее состояние набора и текущее состояние изменений помещаются во временную таблицу "ДвиженияСерииНоменклатурыКРасходуПередЗаписью",
	// чтобы при записи получить изменение нового набора относительно первоначального.
		Запрос = Новый Запрос("ВЫБРАТЬ
			|	ДвиженияСерииНоменклатурыКРасходуИзменение.НомерСтроки КАК НомерСтроки,
			|	ДвиженияСерииНоменклатурыКРасходуИзменение.Номенклатура КАК Номенклатура,
			|	ДвиженияСерииНоменклатурыКРасходуИзменение.Характеристика КАК Характеристика,
			|	ДвиженияСерииНоменклатурыКРасходуИзменение.Партия КАК Партия,
			|	ДвиженияСерииНоменклатурыКРасходуИзменение.Серия КАК Серия,
			|	ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
			|	ДвиженияСерииНоменклатурыКРасходуИзменение.КоличествоПередЗаписью КАК КоличествоПередЗаписью
			|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыКРасходуПередЗаписью
			|ИЗ
			|	ДвиженияСерииНоменклатурыКРасходуИзменение КАК ДвиженияСерииНоменклатурыКРасходуИзменение
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СерииНоменклатурыКРасходу.НомерСтроки,
			|	СерииНоменклатурыКРасходу.Номенклатура,
			|	СерииНоменклатурыКРасходу.Характеристика,
			|	СерииНоменклатурыКРасходу.Партия,
			|	СерииНоменклатурыКРасходу.Серия,
			|	СерииНоменклатурыКРасходу.СтруктурнаяЕдиница,
			|	ВЫБОР
			|		КОГДА СерииНоменклатурыКРасходу.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|			ТОГДА СерииНоменклатурыКРасходу.Количество
			|		ИНАЧЕ -СерииНоменклатурыКРасходу.Количество
			|	КОНЕЦ
			|ИЗ
			|	РегистрНакопления.СерииНоменклатурыКРасходу КАК СерииНоменклатурыКРасходу
			|ГДЕ
			|	СерииНоменклатурыКРасходу.Регистратор = &Регистратор
			|	И &Замещение");

		Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
		Запрос.УстановитьПараметр("Замещение", Замещение);

		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();

	КонецЕсли;

	// Временная таблица "ДвиженияСерииНоменклатурыКРасходуИзменение" уничтожается
	// Удаляется информация о ее существовании.
	Если СтруктураВременныеТаблицы.Свойство("ДвиженияСерииНоменклатурыКРасходуИзменение") Тогда

		Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСерииНоменклатурыКРасходуИзменение");
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		СтруктураВременныеТаблицы.Удалить("ДвиженияСерииНоменклатурыКРасходуИзменение");

	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ПриЗаписи набора записей.
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		ИЛИ НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
		ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу "ДвиженияСерииНоменклатурыКРасходуИзменение".
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МИНИМУМ(ДвиженияСерииНоменклатурыКРасходуИзменение.НомерСтроки) КАК НомерСтроки,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Номенклатура КАК Номенклатура,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Характеристика КАК Характеристика,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Партия КАК Партия,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Серия КАК Серия,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СУММА(ДвиженияСерииНоменклатурыКРасходуИзменение.КоличествоПередЗаписью) КАК КоличествоПередЗаписью,
	|	СУММА(ДвиженияСерииНоменклатурыКРасходуИзменение.КоличествоИзменение) КАК КоличествоИзменение,
	|	СУММА(ДвиженияСерииНоменклатурыКРасходуИзменение.КоличествоПриЗаписи) КАК КоличествоПриЗаписи
	|ПОМЕСТИТЬ ДвиженияСерииНоменклатурыКРасходуИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.НомерСтроки КАК НомерСтроки,
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.Номенклатура КАК Номенклатура,
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.Характеристика КАК Характеристика,
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.Партия КАК Партия,
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.Серия КАК Серия,
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.КоличествоПередЗаписью КАК КоличествоПередЗаписью,
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью.КоличествоПередЗаписью КАК КоличествоИзменение,
	|		0 КАК КоличествоПриЗаписи
	|	ИЗ
	|		ДвиженияСерииНоменклатурыКРасходуПередЗаписью КАК ДвиженияСерииНоменклатурыКРасходуПередЗаписью
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.НомерСтроки,
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Номенклатура,
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Характеристика,
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Партия,
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Серия,
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.СтруктурнаяЕдиница,
	|		0,
	|		ВЫБОР
	|			КОГДА ДвиженияСерииНоменклатурыКРасходуПриЗаписи.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Количество
	|			ИНАЧЕ ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Количество
	|		КОНЕЦ,
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Количество
	|	ИЗ
	|		РегистрНакопления.СерииНоменклатурыКРасходу КАК ДвиженияСерииНоменклатурыКРасходуПриЗаписи
	|	ГДЕ
	|		ДвиженияСерииНоменклатурыКРасходуПриЗаписи.Регистратор = &Регистратор) КАК
	|		ДвиженияСерииНоменклатурыКРасходуИзменение
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Номенклатура,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Характеристика,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Партия,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.Серия,
	|	ДвиженияСерииНоменклатурыКРасходуИзменение.СтруктурнаяЕдиница
	|ИМЕЮЩИЕ
	|	СУММА(ДвиженияСерииНоменклатурыКРасходуИзменение.КоличествоИзменение) <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	Серия,
	|	СтруктурнаяЕдиница");
	
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Новые изменения были помещены во временную таблицу "ДвиженияСерииНоменклатурыКРасходуИзменение".
	// Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияСерииНоменклатурыКРасходуИзменение", ВыборкаИзРезультатаЗапроса.Количество > 0);
	
	// Временная таблица "ДвиженияСерииНоменклатурыКРасходуПередЗаписью" уничтожается
	Запрос = Новый Запрос("УНИЧТОЖИТЬ ДвиженияСерииНоменклатурыКРасходуПередЗаписью");
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
